<h4>API в PHP</h4>
<p>
	В интернете часто делают специальные сервисы, раздающие некоторую информацию всем желающим. К примеру, сервисы погоды или сервисы курсов валют.
</p>
<p>
	Эти сервисы для доступа к данным предоставляют API. Под API подразумевают набор URL, к которым можно обращаться ля получения данных.
</p>
<p>
	Такие API удобно использовать при создании своего сайта. К примеру, можно сделать сайт, показывающий погоду. Для этого он может воспользоваться уже существующим сторонним API.
</p>
<p>
	Также часто удобно создавать API на своем сайте на стороне бэка. А фронт часть сайта будет обращаться к этому API получая и изменяя информацию.
</p>
<p>
	С данном разделе сайта мы изучим, как создавать свои API, какие при этом есть нюансы, а также научимся работать с чужими API, применяя их в своих проектах.
</p>