<h4>Расширение PDO в PHP</h4>
<p>
    В PHP существует два подхода для работы с базой данных: mysqli, который вы уже знаете, и PDO. В данном разделе сайта мы будем изучать расширение PDO, которое расшифровывается как PHP Data Objects.
    <br/>
    Расширение PDO позволяет работать с базой данных через ООП. Кроме того, оно представляет удобный механизм для предотвращения SQL-инъекций.
</p>
<div class="navigate_arrow">
	<a href="/sqlsecure/8_value_list/">Назад</a>
	<a href="/pdo/1_test_table/">Вперёд</a>
</div>