<h4>Безопасность SQL в PHP</h4>
<p>
	В предыдущих уроках, когда мы изучали работу с SQL в PHP, мы не изучали такой важный раздел, как безопасность. Дело в том, что по умолчанию SQL запросы, которые мы делаем через PHP имеют уязвимости, которыми может воспользоваться хакер, чтобы взломать наш сайт.
</p>
<p>
	В данном разделе мы начнем изучать основные проблемы, которые ведут к уязвимостям, а также защиту от них.
</p>
<div class="navigate_arrow">
	<a href="/api/14_using/">Назад</a>
	<a href="/sqlsecure/1">Вперёд</a>
</div>